tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "azure/kubelogin"
tap "derailed/popeye"
tap "harelba/q"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "jotta/cli"
tap "lizardbyte/homebrew"
tap "mike-engel/jwt-cli"
tap "rs/tap"
tap "universal-ctags/universal-ctags"
tap "warrensbox/tap"
tap "wez/wezterm"
tap "xwmx/taps"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Text to speech, software speech synthesizer
brew "espeak"
# High-performance JSON to GRON converter
brew "fastgron"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line option parsing utility
brew "gnu-getopt"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line JSON pretty-printer
brew "jsonpp"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Postgres C API library
brew "libpq"
# Powerful, lightweight programming language
brew "lua"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# PGP packet visualizer
brew "pgpdump"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# Object-relational database system
brew "postgresql@15", link: true
# Official PostgreSQL ODBC driver
brew "psqlodbc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Yet Another Dotfiles Manager
brew "yadm"
# General-purpose lossless data-compression library
brew "zlib"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# Run SQL directly on CSV or TSV files, and on multiple sqlite databases
brew "harelba/q/q"
# Jottacloud CLI
brew "jotta/cli/jotta-cli"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Memory training application
cask "anki"
# Create global hotkeys for your files and applications
cask "apptivate"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
cask "font-jetbrains-mono-nerd-font"
# GIT client
cask "fork"
# Java IDE by JetBrains
cask "intellij-idea"
# Media system
cask "jellyfin"
# Menu bar manager
cask "jordanbaird-ice"
# Clipboard manager
cask "maccy"
# VPN client
cask "mullvad-vpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Utilise mouse side navigation buttons
cask "sensiblesidebuttons"
# Instant messaging application focusing on security
cask "signal"
# Text editor for code, markup and prose
cask "sublime-text"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
