tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "azure/kubelogin"
tap "derailed/popeye"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mike-engel/jwt-cli"
tap "rs/tap"
tap "universal-ctags/universal-ctags"
tap "warrensbox/tap"
tap "xwmx/taps"
brew "zstd"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "node"
brew "artillery"
brew "autoconf"
brew "python@3.11"
brew "autojump"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bat"
brew "glib"
brew "openssl@1.1"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "p11-kit"
brew "unbound"
brew "libksba"
brew "gnupg"
brew "go"
brew "gopls"
brew "goreleaser"
brew "grep"
brew "helm"
brew "htop"
brew "hub"
brew "libheif"
brew "tcl-tk"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "jsonpp"
brew "krb5"
brew "kubernetes-cli", link: false
brew "krew"
brew "kubectx"
brew "kubescape"
brew "kubeseal"
brew "kubeval"
brew "libssh2"
brew "libpq"
brew "libssh"
brew "lua"
brew "openjdk"
brew "maven"
brew "msgpack"
brew "neovim"
brew "nmap"
brew "pass"
brew "pgpdump"
brew "pinentry-mac"
brew "psqlodbc"
brew "python@3.8"
brew "ripgrep"
brew "rust-analyzer"
brew "starship", link: false
brew "stern"
brew "telnet"
brew "tfenv"
brew "tflint"
brew "watch"
brew "wget"
brew "wireshark", link: false
brew "yadm"
brew "zlib"
brew "azure/kubelogin/kubelogin"
brew "derailed/popeye/popeye"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "warrensbox/tap/tfswitch"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "apptivate"
cask "authy"
cask "bartender"
cask "contexts"
cask "discord"
cask "easy-move-plus-resize"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "intellij-idea"
cask "iterm2"
cask "little-snitch"
cask "maccy"
cask "microsoft-teams"
cask "openinterminal"
cask "openlens"
cask "rectangle"
cask "sensiblesidebuttons"
cask "signal"
cask "spotify"
cask "sublime-text"
cask "wireshark"
