tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "azure/functions"
tap "azure/kubelogin"
tap "clementtsang/bottom"
tap "derailed/popeye"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "rs/tap"
tap "universal-ctags/universal-ctags"
tap "warrensbox/tap"
tap "wez/wezterm"
brew "amp"
brew "asciidoctor"
brew "autoconf"
brew "autojump"
brew "automake"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bottom"
brew "calc"
brew "certigo"
brew "circleci"
brew "cmake"
brew "code-minimap"
brew "coreutils"
brew "cscope"
brew "dive"
brew "docutils"
brew "e2fsprogs"
brew "emacs"
brew "envchain"
brew "exa"
brew "folly"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "glib"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gopls"
brew "goreleaser"
brew "grep"
brew "helm"
brew "htop"
brew "hub"
brew "hugo"
brew "python@3.9"
brew "libheif"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "jsonpp"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "krew"
brew "ktlint"
brew "kube-ps1"
brew "kubectx"
brew "kubeval"
brew "ledger"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "maven"
brew "mosh"
brew "msgpack"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "pass"
brew "pinentry-mac"
brew "postgresql@11"
brew "psqlodbc"
brew "python@3.8"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "rust-analyzer"
brew "s3cmd"
brew "starship"
brew "stern"
brew "terraformer"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "watch"
brew "watchman"
brew "wget"
brew "yadm"
brew "yaml-language-server"
brew "yq"
brew "zlib"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "aws/tap/aws-sam-cli"
brew "azure/functions/azure-functions-core-tools@2"
brew "azure/functions/azure-functions-core-tools@3"
brew "azure/functions/azure-functions-core-tools@4", link: false
brew "azure/kubelogin/kubelogin"
brew "derailed/popeye/popeye"
brew "hashicorp/tap/terraform-ls"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "warrensbox/tap/tfswitch"
cask "1password"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "alacritty"
cask "apptivate"
cask "bartender"
cask "caffeine"
cask "contexts"
cask "discord"
cask "firefox"
cask "intellij-idea"
cask "maccy"
cask "microsoft-teams"
cask "notion"
cask "openinterminal"
cask "paw"
cask "qutebrowser"
cask "rectangle"
cask "sensiblesidebuttons"
cask "signal"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "typora"
cask "vimr"
cask "virtualbox"
cask "wezterm"
cask "zulip"
